package comyhyhyhte.example.gaowenxing.materialtest;

/**
 * Created by lx on 2017/3/2.
 */

public class FruitIntroduce {

    public static String generateFruitContent(String frameName){
        String fruitContent;
        if(frameName.equals("苹果")){
            fruitContent="红富士苹果的简介 \n" +
                    "\" +\n" +
                    "                    \"红富士苹果果实近圆形，果面底色黄绿，大部 分果面着橘红色霞，覆有鲜红色条纹，果肉黄白色 ，肉质细脆，酸甜适口，有香味，品质上等。  \\n\" +\n" +
                    "                    \"营养价值：红富士苹果含有钙 磷 铁 维生素 B2 维生素C等丰富的营养，色、香、味\\n\" +\n" +
                    "                    \"俱佳。  \\n\" +\n" +
                    "                    \"健康功效：苹果是心血管的保护神、心脏病患 者的健康水果，因为它不含饱和脂肪、\\n\" +\n" +
                    "                    \"胆固醇和钠 。苹果中的胶质能保持血糖的稳定，所以苹果不但 是糖尿病患者的健康小吃，而且是一切想要控制血 糖水平的人必不可少的水果。并且它还能有效地降 低胆固醇。苹果汁有强大的杀灭传染性病毒的作用 。吃较多苹果的人远比不吃或少吃苹果的人得感冒 机会要低。所以，有的科学家和医师把苹果称为“ 全方位的健康水果”，或称为“全科医生”。现在 空气污染比较严重，多吃苹果可改善呼吸系统和肺 功能，保护肺部免受污染和烟尘的影响。苹果还能 防癌，预防铅中毒。祖国医学认为，苹果甘凉，具 有生津止渴、润肺除烦、健脾益胃、养心益气、润 肠、止泻、解暑、醒酒等功效。苹果有着天然的怡 人香气，具有明显的消除压抑感作用。  \\n\" +\n" +
                    "                    \"适合人群：非常适合婴幼儿、老人和病人食用 。现在城市生活节奏十分紧张，职业人\\n\" +\n" +
                    "                    \"群的压力很 大，很多人都有不同程度的紧张、忧郁，这时拿起 一个苹果闻上一闻，不良情绪就会有所缓解，同时 还有提神醒脑之功。准妈妈每天吃个苹果可以减轻 孕期反应。  适用量：每天吃1~2个苹果就足以达到上述效 果了。男性吃苹果的数量应多于女性，因为苹果有 降胆固醇作用。  \\n\" +\n" +
                    "                    \"温馨提示：苹果的营养很丰富。吃苹桌时要细 嚼慢咽，这样不仅有利于消化，更重要\\n\" +\n" +
                    "                    \"的是对减少 人体疾病大有好处。不要在饭前吃水果，以免影响 正常进食及消化。苹果含糖丰富，糖尿病患者切忌 多食。";
            return fruitContent;
        }else if(frameName.equals("西瓜")){
            fruitContent=" 瓜 简 介 \n" +
                    "西瓜（学名：Citrullus lanatus，英文：Watermelon），属葫芦科，原产于非洲。西瓜是一种双子叶开花植物，形状像藤蔓，叶子呈羽毛状。它所结出的果实是瓠果，为葫芦科瓜类所特有的一种肉质果，是由3个心皮具有侧膜胎座的下位子房发育而成的假果。西瓜主要的食用部分为发达的胎座。果实外皮光滑，呈绿色或黄色有花纹，果瓤多汁为红色或黄色（罕见白色）。 \n" +
                    "西瓜堪称“瓜中之王”，味道甘味多汁，清爽解渴，是盛夏佳果，西瓜除不含脂肪和胆固醇外，含有大量葡萄糖、果糖、蛋白氨基酸、及丰富的Vc等物质，是一种富有营养、纯净、食用安全的食品。 一、西瓜的生长发育过程和特点 1、形态特征 \n" +
                    "（1）根   西瓜的根属深根系，主根深达1m以上，侧根横向延伸可达4-6m，主要根群分布在10-40cm土层内，吸肥吸水能力强。根的再生能力弱，受伤以后不易恢复，生产上常采用直播，如果育苗移栽，一定注意根的保护。 \n" +
                    "   （2）茎、叶   西瓜茎又称蔓，主蔓在5-6片叶之前直立生长，超过30cm后长出一定长度时，由于机械组织不发达，支撑不住自身重量，便葡匐地面生长。茎的分枝能力很强，可萌发3~4级侧枝，但以主蔓3-5片叶腋中发出的侧枝较为键壮。西瓜的茎节上极易产生不定根，采用压蔓的办法，可促使不定根形成，增加吸收面积，固定植株，防止滚秧。叶互生，有深裂、浅裂和全缘等类型。";
            return fruitContent;
        }else if(frameName.equals("橙子")){
            fruitContent="橙子的好处  \n" +
                    "1. 橙子含有充分的维生素，柠檬酸（软化血管，降低血脂，增强血管弹性）、果胶（帮助\n" +
                    "排泄脂肪、胆固醇）等成分。橙子属于凉性水果，吃橙子可解油腻，消积食，化痰健胃，增强食欲等等，并可以止渴醒酒。其果肉酸甜适度，富有香气。把橙子制成鲜榨果汁，是绝佳的上等饮品。  \n" +
                    "橙子也是美容的绝品。由于它含有大量的维生素和果胶，它对皮肤能起到补充水分，美白，增强弹性，缓解衰老的功效。不论是吃还是做成面膜，橙子都是给人新鲜嫩白，清爽健康的感觉。橙子甚至可以用来卸妆，而且不伤害皮肤。 橙子是一个好东西，喜欢的话多吃一些对身体很好。 2. 橙子是世界四大名果之一，品种较多，以脐橙最为多见  \n" +
                    "橙又名“黄果”、“金环”，分酸、甜两种。饱食饮宴后 ，饮一杯酸橙汁，可解油腻，消积食，并有止渴醒酒等妙用。其果肉酸甜适度，富有香气。 ";
            return fruitContent;
        }else if(frameName.equals("草莓")){
            fruitContent="草莓品种大全 \n" +
                    "  \n" +
                    "1 \n" +
                    "丰香 \n" +
                    "日本品种，我国于1987年引种。早熟、果大，休眠很浅，果实圆锥形，鲜红色；果面平整，有光泽，外观艳丽；果肉浅红色，硬度中等，不耐长途运输；果实风味优，香甜适\n" +
                    "口；果实糖度高而稳定，可溶性固形物为11.25%。植株开花早，属早熟品种；该品种适应性强，在我国南北方均可栽植，抗寒、抗旱，花期较抗晚霜危害，抗病性极强。 2 \n" +
                    "红颜 \n" +
                    "日本新品种，2001年引进我国，植株长势强，株态直立，易于栽培管理。叶片大，新茎分枝多。连续结果能力强，丰产[亩产3000公斤以上]、品质[味好于丰香具有典型的草莓香味]、果个大，最大果120克，圆锥形，硬度大于所有日本品种，果面红色、有光泽。\n" +
                    "它具有叶绿、花白、果红、味佳的品质，优质特点是个大、色红、味甜。味浓，甜度能达到 14% 至 16% ，一般草莓甜度只有10% 左右。果形果色明显优于丰香。红颜又称红颊，是日本静冈县用幸香与章姬杂交育成的早熟栽培品种良种。根系生长能力和吸收能力强，休眠浅，可抽发4次花序，各花序可连续开花结果，中间无断档。 \n" + "3 \n" +
                    "女峰 \n" +
                    "日本品种，果实圆锥形，整齐，平均单果重12～13克，果面鲜红色，鲜艳，光泽强；果肉淡红色，质细、较致密，风味甜微酸，香气浓郁。含可溶性固形物9.8％，维生素C49.8毫克/百克。露地栽培生长茂盛，结果不良。在设施栽培中花芽分化早，开花早，前期\n" +
                    "产量高，为早熟、品质佳的设施促成栽培品种，主要用于鲜食。适于我国南部及中部草莓种植区作促成栽培，果实耐贮性较好。此品种保护地栽培时会出现无雄蕊的雌性花，影响早期产量，需进行人工辅助授粉。  \n" +"4 \n" +
                    "鬼怒甘 日本品种，女峰的株变，也叫日本1号。果实短圆锥形或扁楔形，平均单果重32克，最大68克。果色浅红，艳丽，有芳香味，极甜，含糖量高达12％～18％，(一般草莓为7％～12％)。12～翌2月采收的果实可自然存放7～10天，3月以后采收的果实存放4～7天。花\n" +
                    "序多，每株2～3枝，连续抽生能力强，可连续结果6个月。该品种适应能力强，既耐高\n" +
                    "温，又抗寒，适合我国南北各地露地、小拱棚、温室栽培，特别适合大棚早熟栽培。抗白粉病、灰霉病能力均强。该品种繁殖能力强，栽种时宜稀植。是目前日本最新培育的优良品种之一。 \n" +
                    "5 \n" +
                    "章姬 \n" +
                    "日本静冈县农民育种家章弘先生生于1985年,以久能早生与女峰杂交育成的早熟品种，\n" +
                    "1992年注册，现是日本主栽品种之一，其特点为果大，长圆锥形，味浓甜，果实软，畸形少，可溶性固形含量9%-14%，味浓甜、芳香，果色艳丽美观，柔软多汁，一级序果平";
            return fruitContent;
        }else if(frameName.equals("菠萝")){
            fruitContent="菠萝原名凤梨，原产于南美洲， 16世纪从巴西传入中国， 有70多个品种， 岭南四大名果之一。 \n" +
                    "16世纪中期由葡萄牙的传教士带到澳门，然后引进到广东各地，后在广西、福建、台湾等省栽种，经过长期的选育，陆续产生了许多品种。 \n" +
                    "我国是菠萝十大主产国之一，主要分布在广东、海南、广西、福建、云南等热区省。 \n" +
                    "菠萝生产通常有4个采收季节：春果，4～5月成熟；正造果(夏果)6～7月成熟；秋果，10～11月成熟；冬果，12月～翌年1月成熟。 \n" +
                    "菠萝含有大量的果糖，葡萄糖，维生素B、C，磷，柠檬酸和蛋白酶等物。性味甘平，具有解暑止渴、消食止泻之功，为夏令医食兼优的时令佳果。 \n" +
                    "菠萝的营养价值 每100克菠萝含水分87.1克，蛋白质0.5克，脂肪0.1克，纤维1.2克，尼克酸0.1毫克，钾126毫克，钠1.2毫克，锌0.08毫克，碳水化合物8.5克，钙20毫克，磷6毫克，铁0.2毫克，胡萝卜素0.08毫克，硫胺素0.03毫克，核黄素0.02毫克，维生素c18毫克，灰分0.3克，另含多种有机酸及菠萝酶等。 \n" +
                    "1、菠萝含有一种叫“菠萝朊酶”的物质，它能分解蛋白质，溶解阻塞于组织中的纤维蛋白和血凝块，改善局部的血液循环，消除炎症和水肿； \n" +
                    "2、菠萝中所含糖、盐类和酶有利尿作用，适当食用对肾炎，高血压病患者有益； \n" +
                    "3、菠萝性味甘平，具有健胃消食、补脾止泻、清胃解渴等功用。";
            return fruitContent;
        }
        return "";

    }

}
